#' @import dplyr
#' 
################################################################################
## 01. 도로명주소 DB
################################################################################
##==============================================================================
## 01.01. 도로명주소 데이터 읽기
##==============================================================================
##------------------------------------------------------------------------------
## 01.01.01. 파일 정보
##------------------------------------------------------------------------------
## https://business.juso.go.kr/addrlink/attrbDBDwld/attrbDBDwldList.do?cPath=99MD&menu=%EB%8F%84%EB%A1%9C%EB%AA%85%EC%A3%BC%EC%86%8C+%ED%95%9C%EA%B8%80
## 주소기반산업지원서비스 > 공개하는 주소 > 도로명주소 한글 > 전체자료 > 2022년 6월
data_path <- here::here("raw", "meta", "202206_도로명주소 한글_전체분")
fnames <- list.files(data_path, pattern = "txt")

library(tidyverse)
##------------------------------------------------------------------------------
## 01.01.02. 파일 데이터 읽기
##------------------------------------------------------------------------------
## local 인수를 사용하면 system crashed되어서 iconv()를 사용하여 한글 인코딩 처리
build_info <- fnames %>% 
  purrr::map_df(
    function(x) {
      print(x)
      fname <- glue::glue("{data_path}/{x}")
      
      build <- readr::read_delim(fname, delim = "|", col_names = FALSE,
                                 # locale = readr::locale("ko", encoding = "euc-kr"),
                                 col_types = "ccccccciiccciicccccccccc", 
                                 )
      
      # build %>% 
      #   select(-시도영문, -시군구영문, -읍면영문, -도로명영문)
    }
  ) %>% 
  mutate_all(iconv, "cp949", "utf-8") 

##------------------------------------------------------------------------------
## 01.01.03. 변수이름, 제공하는 변수 이름 그대로 적용함
##------------------------------------------------------------------------------
names(build_info) <- c("도로명주소관리번호", "법정동코드", "시도명", "시군구명",
                       "읍면동명", "리명", "산여부", "번지", "호", "도로명코드",
                       "도로명", "지하여부", "건물본번", "건물부번", "행정동코드",
                       "행정동명", "우편번호", "이전도로명주소", "효력발생일",
                       "공동주택구분", "이동사유코드", "건축물대장건물명", 
                       "시군구용건물명", "비고")


##==============================================================================
## 01.02. 도로명주소 전처리
##==============================================================================
##------------------------------------------------------------------------------
## 01.02.01. 모든 관측치가 결측치인 컬럼 제거
##------------------------------------------------------------------------------
no_missing <- build_info %>% 
  summarise_all(function(x) sum(!is.na(x))) %>% 
  select_if(function(x) x > 0) %>% 
  names()
  
build_info <- build_info %>% 
  select(all_of(no_missing))


################################################################################
## 02. 우편번호 매핑 정보 추출하기
################################################################################
##==============================================================================
## 01.01. 우편번호 : 광역시도 + 시군구 + 읍면동 추출
##==============================================================================
##------------------------------------------------------------------------------
## 01.01.01. 우편번호 : 광역시도 + 시군구 + 읍면동(행정동) 추출하기 
##------------------------------------------------------------------------------
post_admi <- build_info %>% 
  filter(!is.na(행정동명)) %>% 
  select(우편번호, 시도명, 시군구명, 행정동명) %>% 
  mutate(행정동명 = stringr::str_replace_all(행정동명, "\\.", "·")) %>%   
  mutate(행정동명 = stringr::str_replace(행정동명, "([[:alpha:]]+)(제)([[:number:]]+)(동)", "\\1\\3\\4")) %>%  
  mutate(행정동명 = stringr::str_replace(행정동명, "([[:alpha:]]+)(제)([[:number:]]+)(·)([[:number:]]+)(동)", "\\1\\3\\4\\5\\6")) %>%  
  mutate(행정동명 = stringr::str_replace(행정동명, "탑대성동", "탑·대성동")) %>%   
  rename(post_cd = 우편번호,
         mega_nm = 시도명,
         cty_nm = 시군구명,
         admi_nm = 행정동명) %>% 
  unique()   

##------------------------------------------------------------------------------
## 01.01.02. 우편번호 : 행정동 = 1 : N 대상건 제거하기 
##------------------------------------------------------------------------------
post_admi <- post_admi %>% 
  filter(!post_cd %in% (post_admi %>% 
           count(post_cd) %>% 
           filter(n > 1) %>% 
           select(post_cd) %>% 
           pull())
  )
  

##==============================================================================
## 02. 우편번호 매핑정보의 bitSpatial 정보로 변환하기
##==============================================================================
##------------------------------------------------------------------------------
## 02.01.01. 완전 매칭 건 추출
## 29,241건 매칭
##------------------------------------------------------------------------------
post_admi <- post_admi %>% 
  inner_join(
    admi,
    by = c("mega_nm", "cty_nm", "admi_nm")
  ) %>% 
  select(post_cd, base_ym, mega_nm, mega_cd, cty_nm, cty_cd, admi_nm, admi_cd)



################################################################################
## 03. 주소 매핑 정보 추출하기
################################################################################
##==============================================================================
## 03.01. 주소(광역시도 + 시군구 + 도로명 + 건물본번) : 광역시도 + 시군구 + 읍면동 
##==============================================================================
##------------------------------------------------------------------------------
## 03.01.01. 매핑 정보 추출
##------------------------------------------------------------------------------
build_admi <- build_info %>% 
  filter(!is.na(행정동명)) %>% 
  select(시도명, 시군구명, 도로명, 건물본번, 행정동명) %>% 
  mutate(행정동명 = stringr::str_replace_all(행정동명, "\\.", "·")) %>%   
  mutate(행정동명 = stringr::str_replace(행정동명, "([[:alpha:]]+)(제)([[:number:]]+)(동)", "\\1\\3\\4")) %>%  
  mutate(행정동명 = stringr::str_replace(행정동명, "([[:alpha:]]+)(제)([[:number:]]+)(·)([[:number:]]+)(동)", "\\1\\3\\4\\5\\6")) %>%  
  mutate(행정동명 = stringr::str_replace(행정동명, "탑대성동", "탑·대성동")) %>%   
  rename(mega_nm = 시도명,
         cty_nm = 시군구명,
         road_nm = 도로명,
         major_no = 건물본번,
         admi_nm = 행정동명) %>% 
  unique()   


##------------------------------------------------------------------------------
## 03.01.02. 광역시도 + 시군구 + 읍명동 레벨의 도로명 주소
##------------------------------------------------------------------------------
road_addr <- build_admi %>% 
  mutate(short_addr = paste(mega_nm, cty_nm, road_nm, major_no)) %>% 
  inner_join(
    admi,
    by = c("mega_nm", "cty_nm", "admi_nm")
  ) %>% 
  select(short_addr, road_nm, major_no, base_ym, mega_nm, mega_cd, cty_nm, cty_cd, admi_nm, admi_cd)


################################################################################
## 03. 데이터 저장하기
################################################################################
##==============================================================================
## 02.01. 우편번호 행정동 매핑 데이터 저장
##==============================================================================
save(post_admi, file = here::here("data", "post_admi.rda"))


##==============================================================================
## 02.02. 주소 매핑 데이터 저장
##==============================================================================
save(road_addr, file = here::here("raw", "rdata", "road_addr.rda"))



